Revit 2027 API
AnalyticalEquipmentLoadData.LoadSet Property
 The electrical analytical load set of the analytical equipment load.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId LoadSet { get; set; }
Public Property LoadSet As ElementId
	Get
	Set
public:
property ElementId^ LoadSet {
	ElementId^ get ();
	void set (ElementId^ value);
}
member LoadSet : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given element id loadSetId is neither a load set id nor invalidElementId.
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 invalidElementId if the analytical equipment load does not belong to any analytical load sets.
See Also
Reference
AnalyticalEquipmentLoadData Class
Autodesk.Revit.DB.Electrical Namespace